
 export const Header = () => {
    return (
        <header>
            todo1 (1)
   <br />  1.Webpack нужен для того чтобы обьединить множество модулей JavaScript в один единый файл. Сборщик модулей. 
   <br />  2.Babel нужен для того чтобы современные коды перевести в старые чтобы браузер мог понять.
   <br />  3.Node.js — это среда выполнения кода, написанного на JavaScript, для разработки бэкенда приложений.
    <br /> todo (2)
   <br />  1.React — это библиотека JavaScript c открытым кодом для создания внешних пользовательских интерфейсов.
   <br />  2.node.js позволяет расширить области применения JavaScript.
   <br />  3.npm -менеджер пакетов, который устанавливается вместе c платформой NodeJS.Благодаря npm Node.js так популярен,
   <br />  мы можем установить любой пакет, созданный другими разработчиками, для облегчения решения задачи.
    <br /> 4.Create React App позволяет создавать предварительно настроенные React-проекты.
     <br/>5.для быстрого старта React-приложений. Вы не тратите время на настройку Webpack, Babel и других привычных инструментов.
   <br /> 6.Гибкость. Разработчики могут использовать React для создания UI-компонентов на разных платформах.
    <br /> Возможность установки отдельных компонентов. C помощью React вы сможете установить кнопки, логотипы, текстовые фрагменты и другие элементы сайтов.
  <br /> Удобство в использовании. B среде разработчиков React.
        </header>
        
    )
}